import Foundation

public let linesTokens202006: [String: Tokens.GroupToken] = [
    "1. Аренда торгового помещения    -----------------------------":
        .item("1. Аренда торгового помещения", 0, nil),
    "2. Эксплуатационные расходы    -----------------------------":
        .item("2. Эксплуатационные расходы", 0, nil),
    "3. Электричество    -----------------------------":
        .item("3. Электричество", 0, nil),
    "4. Водоснабжение    -----------------------------":
        .item("4. Водоснабжение", 0, nil),
    "5. Аренда головного офиса    11.500":
        .item("5. Аренда головного офиса", 11_500, nil),
    "6. Аренда головного склада    -----------------------------":
        .item("6. Аренда головного склада", 0, nil),
    "7.Вывоз мусора    -----------------------------":
        .item("7. Вывоз мусора", 0, nil),
    "1.ФОТ    19.721 ( за вторую часть июня мы выдаем с 10 по 15 июля, а первая часть июля с 25 по 30 июля)":
        .item("1. ФОТ", 19_721, "( за вторую часть июня мы выдаем с 10 по 15 июля, а первая часть июля с 25 по 30 июля)"),
    "1. Приход товара по накладным    451.198р41к (из них у нас оплачено фактический 21.346р15к)":
        .item("1. Приход товара по накладным", 21_346.15, "451.198р41к (из них у нас оплачено фактический 21.346р15к)"),
    "2. Предоплаченный товар, но не отраженный в приходе    15.800":
        .item("2. Предоплаченный товар, но не отраженный в приходе", 15_800, nil),
    "1.Налоговые платежи     ----------------------------":
        .item("1. Налоговые платежи", 0, nil),
    "2.Банковское обслуживание    4.544":
        .item("2. Банковское обслуживание", 4_544, nil),
    "3.Юридическое сопровождение    -----------------------------":
        .item("3. Юридическое сопровождение", 0, nil),
    "4.Банковская комиссия 1.6% за эквайринг    2.120":
        .item("4. Банковская комиссия 1.6% за эквайринг", 2_120, nil),
    "5. Тайный гость    -----------------------------":
        .item("5. Тайный гость", 0, nil),
    "6.Обслуживание кассовой программы    ----------------------------":
        .item("6. Обслуживание кассовой программы", 0, nil),
    "7. Обслуживание хостинга    ----------------------------":
        .item("7. Обслуживание хостинга", 0, nil),
    "8.Обслуживание мобильного приложения    ----------------------------":
        .item("8. Обслуживание мобильного приложения", 0, nil),
    "9. Реклама и IT поддержка    16.300":
        .item("9. Реклама и IT поддержка", 16_300, nil),
    "10.Обслуживание пожарной охраны    -----------------------------":
        .item("10. Обслуживание пожарной охраны", 0, nil),
    "11.Вневедомственная охрана помещения    -----------------------------":
        .item("11. Вневедомственная охрана помещения", 0, nil),
    "12.Интернет    -----------------------------":
        .item("12. Интернет", 0, nil),
    "13.Дезобработка помещения    -----------------------------":
        .item("13. Дезобработка помещения", 0, nil),
    "14.-----------------------------------------------------------------    -----------------------------":
        .item("14.", 0, nil),
    "15.Аренда зарядных устройств и раций    -----------------------------":
        .item("15. Аренда зарядных устройств и раций", 0, nil),
    "16. Текущие мелкие расходы     1.200":
        .item("16. Текущие мелкие расходы", 1_200, nil),
    "17. Обслуживание Жироуловителей    -----------------------------":
        .item("17. Обслуживание Жироуловителей", 0, nil),
    "18. -----------------------------------------------------------------    -----------------------------":
        .item("18.", 0, nil),
    "19. Ремонт оборудования    -----------------------------":
        .item("19. Ремонт оборудования", 0, nil),
    "20. Чистка вентиляции    -----------------------------":
        .item("20. Чистка вентиляции", 0, nil),
    "21. Обслуживание банкетов    -----------------------------":
        .item("21. Обслуживание банкетов", 0, nil),
    "1. Курьеры    -----------------------------":
        .item("1. Курьеры", 0, nil),
    "2. Агрегаторы    -----------------------------":
        .item("2. Агрегаторы", 0, nil),
    "ИТОГ:":
        .item("ИТОГ", 0, nil)

]

public let linesTokens202007: [String: Tokens.GroupToken] = [
    "1. Аренда торгового помещения    46.667 (за июнь)":
        .item("1. Аренда торгового помещения", 46_667, "(за июнь)"),
    "2. Эксплуатационные расходы    -----------------------------":
        .item("2. Эксплуатационные расходы", 0, nil),
    "3. Электричество    -----------------------------":
        .item("3. Электричество", 0, nil),
    "4. Водоснабжение    -----------------------------":
        .item("4. Водоснабжение", 0, nil),
    "5. Аренда головного офиса    11.500":
        .item("5. Аренда головного офиса", 11_500, nil),
    "6. Аренда головного склада    7.000":
        .item("6. Аренда головного склада", 7_000, nil),
    "7. Вывоз мусора    -----------------------------":
        .item("7. Вывоз мусора", 0, nil),
    "1.ФОТ     704.848 ( за вторую часть июня мы выдаем с 10 по 15 июля, а первая часть июля с 25 по 30 июля)":
        .item("1. ФОТ", 704_848, "( за вторую часть июня мы выдаем с 10 по 15 июля, а первая часть июля с 25 по 30 июля)"),
    "ФОТ Бренд, логистика, бухгалтерия    99.000":
        .item("ФОТ Бренд, логистика, бухгалтерия", 99_000, nil),
    "1. Приход товара по накладным    922.936р37к (оплаты фактические: 313.570р26к-переводы; 87.091р20к-корпоративная карта; 97.712-наличные из кассы; Итого-498.373р46к)":
        .item("1. Приход товара по накладным", 498_373.46, "922.936р37к (оплаты фактические: 313.570р26к-переводы; 87.091р20к-корпоративная карта; 97.712-наличные из кассы; Итого-498.373р46к)"),
    "2. Предоплаченный товар, но не отраженный в приходе    Бейсболки персонал-18.000; Подушки в зал-22.400; Итого-40.400":
        .item("2. Предоплаченный товар, но не отраженный в приходе    Бейсболки персонал-18.000; Подушки в зал-22.400; Итого-40.400", 40_400, nil),
    "1.Налоговые платежи     13.318р93к":
        .item("1. Налоговые платежи", 13_318.93, nil),
    "2.Банковское обслуживание    5.778":
        .item("2. Банковское обслуживание", 5_778, nil),
    "3.Юридическое сопровождение    20.000":
        .item("3. Юридическое сопровождение", 20_000, nil),
    "4.Банковская комиссия 1.6% за эквайринг    12.785":
        .item("4. Банковская комиссия 1.6% за эквайринг", 12_785, nil),
    "5. Тайный гость    -----------------------------":
        .item("5. Тайный гость", 0, nil),
    "6.Обслуживание кассовой программы    21.806р20к":
        .item("6. Обслуживание кассовой программы", 21_806.20, nil),
    "7. Обслуживание хостинга    ----------------------------":
        .item("7. Обслуживание хостинга", 0, nil),
    "8.Обслуживание мобильного приложения    ----------------------------":
        .item("8. Обслуживание мобильного приложения", 0, nil),
    "9. Реклама и IT поддержка    104.000":
        .item("9. Реклама и IT поддержка", 104_000, nil),
    "10.Обслуживание пожарной охраны    -----------------------------":
        .item("10. Обслуживание пожарной охраны", 0, nil),
    "11.Вневедомственная охрана помещения    -----------------------------":
        .item("11. Вневедомственная охрана помещения", 0, nil),
    "12.Интернет    -----------------------------":
        .item("12. Интернет", 0, nil),
    "13.Дезобработка помещения    -----------------------------":
        .item("13. Дезобработка помещения", 0, nil),
    "14. Контур (эл.отчетность)    3.000":
        .item("14. Контур (эл.отчетность)", 3_000, nil),
    "15.Аренда зарядных устройств и раций    -----------------------------":
        .item("15. Аренда зарядных устройств и раций", 0, nil),
    "16. Текущие мелкие расходы     2.910":
        .item("16. Текущие мелкие расходы", 2_910, nil),
    "17. Обслуживание Жироуловителей    -----------------------------":
        .item("17. Обслуживание Жироуловителей", 0, nil),
    "18. Регистрация Кассового аппарата (запасной)    2.000":
        .item("18. Регистрация Кассового аппарата (запасной)", 2_000, nil),
    "19. Ремонт оборудования    -----------------------------":
        .item("19. Ремонт оборудования", 0, nil),
    "20. Чистка вентиляции    -----------------------------":
        .item("20. Чистка вентиляции", 0, nil),
    "21. Обслуживание банкетов    -----------------------------":
        .item("21. Обслуживание банкетов", 0, nil),
    "22. Хэдхантер (подбор пероснала)    3.240":
        .item("22. Хэдхантер (подбор пероснала)", 3_240, nil),
    "23. Аудит кантора (Бухуслуги)    60.000":
        .item("23. Аудит кантора (Бухуслуги)", 60_000, nil),
    "24. Столы Тенгиза    6.100":
        .item("24. Столы Тенгиза", 6_100, nil),
    "25. Стол Игорь    5.470":
        .item("25. Стол Игорь", 5_470, nil),
    "26. Вино отправляли в подарок    1.900":
        .item("26. Вино отправляли в подарок", 1_900, nil),
    "1. Курьеры    -----------------------------":
        .item("1. Курьеры", 0, nil),
    "2. Агрегаторы    6.981":
        .item("2. Агрегаторы", 6_981, nil)
]

#warning("row split and subtraction: -10.000 за перерасход питание персонала в июле")
public let linesTokens202008: [String: Tokens.GroupToken] = [
    "1. Аренда торгового помещения     200.000 (за июль)":
        .item("1. Аренда торгового помещения", 200_000, "(за июль)"),
    "2. Эксплуатационные расходы    -----------------------------":
        .item("2. Эксплуатационные расходы", 0, nil),
    "3. Электричество    -----------------------------":
        .item("3. Электричество", 0, nil),
    "4. Водоснабжение    -----------------------------":
        .item("4. Водоснабжение", 0, nil),
    "5. Аренда головного офиса    11.500":
        .item("5. Аренда головного офиса", 11_500, nil),
    "6. Аренда головного склада    7.000":
        .item("6. Аренда головного склада", 7_000, nil),
    "7. Вывоз мусора    -----------------------------":
        .item("7. Вывоз мусора", 0, nil),
    "1.ФОТ     894.510( за вторую часть июля и первая часть августа)":
        .item("1. ФОТ", 894_510, "( за вторую часть июля и первая часть августа)"),
    "ФОТ Бренд, логистика, бухгалтерия    99.000":
        .item("ФОТ Бренд, логистика, бухгалтерия", 99_000, nil),
    "-10.000 за перерасход питание персонала в июле":
        .item("-10.000 за перерасход питание персонала в июле", -10_000, "ERROR HERE!!!!"),
    "1. Приход товара по накладным     753.950р74к(оплаты фактические: 444.719р 16к -переводы; 75.255р 20к-корпоративная карта; 1.545-наличные из кассы; Итого-521.519р 36к)":
        .item("1. Приход товара по накладным", 521_519.36, "753.950р74к(оплаты фактические: 444.719р 16к -переводы; 75.255р 20к-корпоративная карта; 1.545-наличные из кассы; Итого-521.519р 36к)"),
    "2. Предоплаченный товар, но не отраженный в приходе     КНК Групп-17.300 (плейсметы;ИП Максимов-6.300 (шоколад фирм.,);Итого-23.600":
        .item("2. Предоплаченный товар, но не отраженный в приходе", 23_600, "КНК Групп-17.300 (плейсметы;ИП Максимов-6.300 (шоколад фирм.,);Итого-23.600"),
    "1.Налоговые платежи     20.614":
        .item("1. Налоговые платежи", 20_614, nil),
    "2.Банковское обслуживание    7.234":
        .item("2. Банковское обслуживание", 7_234, nil),
    "3.Юридическое сопровождение    40.000":
        .item("3. Юридическое сопровождение", 40_000, nil),
    "4.Банковская комиссия 1.6% за эквайринг    19.769":
        .item("4. Банковская комиссия 1.6% за эквайринг", 19_769, nil),
    "5.Тайный гость    -----------------------------":
        .item("5. Тайный гость", 0, nil),
    "6.Обслуживание кассовой программы    14.866":
        .item("6. Обслуживание кассовой программы", 14_866, nil),
    "7.Обслуживание хостинга    ----------------------------":
        .item("7. Обслуживание хостинга", 0, nil),
    "8.Обслуживание мобильного приложения    ----------------------------":
        .item("8. Обслуживание мобильного приложения", 0, nil),
    "9.Реклама и IT поддержка    53.500":
        .item("9. Реклама и IT поддержка", 53_500, nil),
    "10.Обслуживание пожарной охраны    -----------------------------":
        .item("10. Обслуживание пожарной охраны", 0, nil),
    "11.Вневедомственная охрана помещения    -----------------------------":
        .item("11. Вневедомственная охрана помещения", 0, nil),
    "12.Интернет    7.701+4.500":
        .item("12. Интернет", 12_201, "7.701+4.500"),
    "13.Дезобработка помещения    -----------------------------":
        .item("13. Дезобработка помещения", 0, nil),
    "14. РПК Ника (крепления д/телевизоров и монтаж)    30.000":
        .item("14. РПК Ника (крепления д/телевизоров и монтаж)", 30_000, nil),
    "15.Аренда зарядных устройств и раций    5.000":
        .item("15. Аренда зарядных устройств и раций", 5_000, nil),
    "16. Текущие мелкие расходы     2.250":
        .item("16. Текущие мелкие расходы", 2_250, nil),
    "17. Обслуживание Жироуловителей    -----------------------------":
        .item("17. Обслуживание Жироуловителей", 0, nil),
    "18. Аренда оборудования д/питьевой воды    5.130":
        .item("18. Аренда оборудования д/питьевой воды", 5_130, nil),
    "19. Ремонт оборудования    -----------------------------":
        .item("19. Ремонт оборудования", 0, nil),
    "20. Чистка вентиляции    -----------------------------":
        .item("20. Чистка вентиляции", 0, nil),
    "21. Обслуживание банкетов    -----------------------------":
        .item("21. Обслуживание банкетов", 0, nil),
    "22. Хэдхантер (подбор пероснала)    ----------------------------":
        .item("22. Хэдхантер (подбор пероснала)", 0, nil),
    "23. Аудит кантора (Бухуслуги)    60.000":
        .item("23. Аудит кантора (Бухуслуги)", 60_000, nil),
    "24. Стол Тенгиз    10.552":
        .item("24. Стол Тенгиз", 10_552, nil),
    "25. Стол Игорь    45.440":
        .item("25. Стол Игорь", 45_440, nil),
    "1. Курьеры    -----------------------------":
        .item("1. Курьеры", 0, nil),
    "2. Агрегаторы    20.586":
        .item("2. Агрегаторы", 20_586, nil)

]

public let linesTokens202009: [String: Tokens.GroupToken] = [
    "1. Аренда торгового помещения     200.000 (за август)":
        .item("1. Аренда торгового помещения", 200_000, "(за август)"),
    "2. Эксплуатационные расходы    -----------------------------":
        .item("2. Эксплуатационные расходы", 0, nil),
    "3. Электричество    -----------------------------":
        .item("3. Электричество", 0, nil),
    "4. Водоснабжение    -----------------------------":
        .item("4. Водоснабжение", 0, nil),
    "5. Аренда головного офиса    11.500":
        .item("5. Аренда головного офиса", 11_500, nil),
    "6. Аренда головного склада    7.000":
        .item("6. Аренда головного склада", 7_000, nil),
    "7. Вывоз мусора    -----------------------------":
        .item("7. Вывоз мусора", 0, nil),
    "1.ФОТ     960.056( за вторую часть августа и первую  часть сентября)":
        .item("1. ФОТ", 960_056, "( за вторую часть августа и первую  часть сентября)"),
    "ФОТ Бренд, логистика, бухгалтерия    99.000":
        .item("ФОТ Бренд, логистика, бухгалтерия", 99_000, nil),
    "1. Приход товара по накладным     946.056р (оплаты фактические: 475.228р 52к -переводы; 157.455р 85к-корпоративная карта; 0-наличные из кассы; Итого-632.684р 37к)":
        .item("1. Приход товара по накладным", 632_684.37, "946.056р (оплаты фактические: 475.228р 52к -переводы; 157.455р 85к-корпоративная карта; 0-наличные из кассы; Итого-632.684р 37к)"),
    "2. Предоплаченный товар, но не отраженный в приходе    Студиопак-12.500 (влажные салфетки);":
        .item("2. Предоплаченный товар, но не отраженный в приходе", 12_500, "Студиопак-12.500 (влажные салфетки);"),
    "1.Налоговые платежи     26.964":
        .item("1. Налоговые платежи", 26_964, nil),
    "2.Банковское обслуживание    6.419":
        .item("2. Банковское обслуживание", 6_419, nil),
    "3.Юридическое сопровождение    40.000":
        .item("3. Юридическое сопровождение", 40_000, nil),
    "4.Банковская комиссия 1.6% за эквайринг    26.581":
        .item("4. Банковская комиссия 1.6% за эквайринг", 26_581, nil),
    "5.Тайный гость    -----------------------------":
        .item("5. Тайный гость", 0, nil),
    "6.Обслуживание кассовой программы Айко    16.336":
        .item("6. Обслуживание кассовой программы Айко", 16_336, nil),
    "7.Обслуживание хостинга    ----------------------------":
        .item("7. Обслуживание хостинга", 0, nil),
    "8.Обслуживание мобильного приложения    9.200":
        .item("8. Обслуживание мобильного приложения", 9_200, nil),
    "9.Реклама и IT поддержка    65.000":
        .item("9. Реклама и IT поддержка", 65_000, nil),
    "10.Обслуживание пожарной охраны    -----------------------------":
        .item("10. Обслуживание пожарной охраны", 0, nil),
    "11.Вневедомственная охрана помещения    -----------------------------":
        .item("11. Вневедомственная охрана помещения", 0, nil),
    "12.Интернет    9.000":
        .item("12. Интернет", 9_000, nil),
    "13.Дезобработка помещения    -----------------------------":
        .item("13. Дезобработка помещения", 0, nil),
    "14. ----------------------------------    ----------------------------":
        .item("14.", 0, nil),
    "15.Аренда зарядных устройств и раций    ----------------------------":
        .item("15. Аренда зарядных устройств и раций", 0, nil),
    "16. Текущие мелкие расходы     1.600":
        .item("16. Текущие мелкие расходы", 1_600, nil),
    "17. Обслуживание Жироуловителей    -----------------------------":
        .item("17. Обслуживание Жироуловителей", 0, nil),
    "18. Аренда оборудования д/питьевой воды    -----------------------------":
        .item("18. Аренда оборудования д/питьевой воды", 0, nil),
    "19. Ремонт оборудования    -----------------------------":
        .item("19. Ремонт оборудования", 0, nil),
    "20. Чистка вентиляции    26.250":
        .item("20. Чистка вентиляции", 26_250, nil),
    "21. Обслуживание банкетов    15.250":
        .item("21. Обслуживание банкетов", 15_250, nil),
    "22. Хэдхантер (подбор пероснала)    9.720":
        .item("22. Хэдхантер (подбор пероснала)", 9_720, nil),
    "23. Аудит кантора (Бухуслуги)    60.000":
        .item("23. Аудит кантора (Бухуслуги)", 60_000, nil),
    "24. Стол Тенгиз    17.905":
        .item("24. Стол Тенгиз", 17_905, nil),
    "25. Стол Игорь    47.090":
        .item("25. Стол Игорь", 47_090, nil),
    "26. Стол Андрей    9.550":
        .item("26. Стол Андрей", 9_550, nil),
    "27. Сервис Гуру (система аттестации, за 1 год)    12.655":
        .item("27. Сервис Гуру (система аттестации, за 1 год)", 12_655, nil),
    "1. Курьеры    -----------------------------":
        .item("1. Курьеры", 0, nil),
    "2. Агрегаторы    18.132":
        .item("2. Агрегаторы", 18_132, nil)
]

public let linesTokens202010: [String: Tokens.GroupToken] = [
    "1. Аренда торгового помещения     200.000 (за август) +400.000 (за сентябрь)":
        .item("1. Аренда торгового помещения", 600_000, "200.000 (за август) +400.000 (за сентябрь)"),
    "2. Эксплуатационные расходы    -----------------------------":
        .item("2. Эксплуатационные расходы", 0, nil),
    "3. Электричество    -----------------------------":
        .item("3. Электричество", 0, nil),
    "4. Водоснабжение    -----------------------------":
        .item("4. Водоснабжение", 0, nil),
    "5. Аренда головного офиса    11.500":
        .item("5. Аренда головного офиса", 11_500, nil),
    "6. Аренда головного склада    7.000":
        .item("6. Аренда головного склада", 7_000, nil),
    "7. Вывоз мусора    -----------------------------":
        .item("7. Вывоз мусора", 0, nil),
    "1.ФОТ     1.147.085( за вторую часть сентября и первую  часть октября)":
        .item("1. ФОТ", 1_147_085, "( за вторую часть сентября и первую  часть октября)"),
    "ФОТ Бренд, логистика, бухгалтерия    99.000":
        .item("ФОТ Бренд, логистика, бухгалтерия", 99_000, nil),
    "1. Приход товара по накладным     907.841р; (оплаты фактические: 529.875р 50к -переводы; 98.340р 24к-корпоративная карта; 0-наличные из кассы; Итого-628.215р 74к)":
        .item("1. Приход товара по накладным", 628_215.74, "907.841р; (оплаты фактические: 529.875р 50к -переводы; 98.340р 24к-корпоративная карта; 0-наличные из кассы; Итого-628.215р 74к)"),
    "1.Налоговые платежи     35.311":
        .item("1. Налоговые платежи", 35_311, nil),
    "2.Банковское обслуживание    6.279":
        .item("2. Банковское обслуживание", 6_279, nil),
    "3.Юридическое сопровождение    40.000":
        .item("3. Юридическое сопровождение", 40_000, nil),
    "4.Банковская комиссия 1.6% за эквайринг    31.587":
        .item("4. Банковская комиссия 1.6% за эквайринг", 31_587, nil),
    "5.Тайный гость    -----------------------------":
        .item("5. Тайный гость", 0, nil),
    "6.Обслуживание кассовой программы Айко    8.435":
        .item("6. Обслуживание кассовой программы Айко", 8_435, nil),
    "7.Обслуживание хостинга    ----------------------------":
        .item("7. Обслуживание хостинга", 0, nil),
    "8.Обслуживание мобильного приложения    9.200":
        .item("8. Обслуживание мобильного приложения", 9_200, nil),
    "9.Реклама и IT поддержка    85.000":
        .item("9. Реклама и IT поддержка", 85_000, nil),
    "10.Обслуживание пожарной охраны    -----------------------------":
        .item("10. Обслуживание пожарной охраны", 0, nil),
    "11.Вневедомственная охрана помещения    -----------------------------":
        .item("11. Вневедомственная охрана помещения", 0, nil),
    "12.Интернет    ----------------------------":
        .item("12. Интернет", 0, nil),
    "13.Дезобработка помещения    -----------------------------":
        .item("13. Дезобработка помещения", 0, nil),
    "14. Вышивка логотипа на одежде    2.836":
        .item("14. Вышивка логотипа на одежде", 2_836, nil),
    "15.Аренда зарядных устройств и раций    10.000":
        .item("15. Аренда зарядных устройств и раций", 10_000, nil),
    "16. Текущие мелкие расходы     5.460":
        .item("16. Текущие мелкие расходы", 5_460, nil),
    "17. Обслуживание Жироуловителей    -----------------------------":
        .item("17. Обслуживание Жироуловителей", 0, nil),
    "18. Аренда оборудования д/питьевой воды    5.130":
        .item("18. Аренда оборудования д/питьевой воды", 5_130, nil),
    "19. Ремонт оборудования    6.610":
        .item("19. Ремонт оборудования", 6_610, nil),
    "20. Чистка вентиляции    35.000":
        .item("20. Чистка вентиляции", 35_000, nil),
    "21. Обслуживание банкетов    5.625":
        .item("21. Обслуживание банкетов", 5_625, nil),
    "22. Хэдхантер (подбор пероснала)    4.227":
        .item("22. Хэдхантер (подбор пероснала)", 4_227, nil),
    "23. Аудит кантора (Бухуслуги)    60.000":
        .item("23. Аудит кантора (Бухуслуги)", 60_000, nil),
    "1. Курьеры    -----------------------------":
        .item("1. Курьеры", 0, nil),
    "2. Агрегаторы    21.541":
        .item("2. Агрегаторы", 21_541, nil)
]

public let linesTokens202011: [String: Tokens.GroupToken] = [
    "1. Аренда торгового помещения     500.000 (за октябрь)":
        .item("1. Аренда торгового помещения", 500_000, "(за октябрь)"),
    "2. Эксплуатационные расходы    -----------------------------":
        .item("2. Эксплуатационные расходы    -----------------------------", 0, nil),
    "3. Электричество    -----------------------------":
        .item("3. Электричество    -----------------------------", 0, nil),
    "4. Водоснабжение    -----------------------------":
        .item("4. Водоснабжение    -----------------------------", 0, nil),
    "5. Аренда головного офиса    11.500":
        .item("5. Аренда головного офиса", 11_500, nil),
    "6. Аренда головного склада    7.000":
        .item("6. Аренда головного склада", 7_000, nil),
    "7. Вывоз мусора    -----------------------------":
        .item("7. Вывоз мусора    -----------------------------", 0, nil),
    "1.ФОТ     564.678( за вторую часть октября)":
        .item("1. ФОТ", 564_678, "( за вторую часть октября)"),
    "ФОТ Бренд, логистика, бухгалтерия    99.000":
        .item("ФОТ Бренд, логистика, бухгалтерия", 99_000, nil),
    "1. Приход товара по накладным     739.457; (оплаты фактические: 357.254р 17к -переводы; 80.220р 30к-корпоративная карта; 0-наличные из кассы; Итого-437.474р 47к)":
        .item("1. Приход товара по накладным", 437_474.47, "739.457; (оплаты фактические: 357.254р 17к -переводы; 80.220р 30к-корпоративная карта; 0-наличные из кассы; Итого-437.474р 47к)"),
    "2. Предоплаченный товар, но не отраженный в приходе    --------------":
        .item("2. Предоплаченный товар, но не отраженный в приходе    --------------", 0, nil),
    "1.Налоговые платежи     31.949р38к":
        .item("1. Налоговые платежи", 31_949.38, nil),
    "2.Банковское обслуживание    5.863р74к":
        .item("2. Банковское обслуживание", 5_863.74, nil),
    "3.Юридическое сопровождение    40.000":
        .item("3. Юридическое сопровождение", 40_000, nil),
    "4.Банковская комиссия 1.6% за эквайринг    22.653":
        .item("4. Банковская комиссия 1.6% за эквайринг", 22_653, nil),
    "5.Тайный гость    -----------------------------":
        .item("5. Тайный гость    -----------------------------", 0, nil),
    "6.Обслуживание кассовой программы Айко    12.000":
        .item("6. Обслуживание кассовой программы Айко", 12_000, nil),
    "7.Обслуживание хостинга    ----------------------------":
        .item("7. Обслуживание хостинга    ----------------------------", 0, nil),
    "8.Обслуживание мобильного приложения    9.200":
        .item("8. Обслуживание мобильного приложения", 9_200, nil),
    "9.Реклама и IT поддержка    90.000":
        .item("9. Реклама и IT поддержка", 90_000, nil),
    "10.Обслуживание пожарной охраны    -----------------------------":
        .item("10. Обслуживание пожарной охраны    -----------------------------", 0, nil),
    "11.Вневедомственная охрана помещения    -----------------------------":
        .item("11. Вневедомственная охрана помещения    -----------------------------", 0, nil),
    "12.Интернет    4.500":
        .item("12. Интернет", 4_500, nil),
    "13.Дезобработка помещения    -----------------------------":
        .item("13. Дезобработка помещения    -----------------------------", 0, nil),
    "14. Поверка весов    3.400":
        .item("14. Поверка весов", 3_400, nil),
    "15.Аренда зарядных устройств и раций    5.000":
        .item("15. Аренда зарядных устройств и раций", 5_000, nil),
    "16. Текущие мелкие расходы     6.690":
        .item("16. Текущие мелкие расходы", 6_690, nil),
    "17. Обслуживание Жироуловителей    -----------------------------":
        .item("17. Обслуживание Жироуловителей    -----------------------------", 0, nil),
    "18. Аренда оборудования д/питьевой воды    5.130":
        .item("18. Аренда оборудования д/питьевой воды", 5_130, nil),
    "19. Ремонт оборудования":
        .item("19. Ремонт оборудования", 0, nil),
    "20. Чистка вентиляции    35.000":
        .item("20. Чистка вентиляции", 35_000, nil),
    "21. Обслуживание банкетов":
        .item("21. Обслуживание банкетов", 0, nil),
    "22. Хэдхантер (подбор пероснала)    9.720":
        .item("22. Хэдхантер (подбор пероснала)", 9_720, nil),
    "23. Аудит кантора (Бухуслуги)    60.000":
        .item("23. Аудит кантора (Бухуслуги)", 60_000, nil),
    "24. Яндекс карты    51.975":
        .item("24. Яндекс карты", 51_975, nil),
    "25. --------    -------------":
        .item("25. --------    -------------", 0, nil),
    "26. ---------    -------------":
        .item("26. ---------    -------------", 0, nil),
    "27. ---------    ------------":
        .item("27. ---------    ------------", 0, nil),
    "1. Курьеры    -----------------------------":
        .item("1. Курьеры    -----------------------------", 0, nil),
    "2. Агрегаторы    17.839":
        .item("2. Агрегаторы", 17_839, nil)
]
